var vm = new Vue({
    el: ".vueBox",
    data: {
        introduceList:[
            {
                q:'1.红包发给谁',
                a:'红包发出后，房间内任何用户均可领取，同一账号至多可领取一次。',
            },
            {
                q:'2.红包谁抢的最多？',
                a:'所有红包均为拼手气红包，手气好的抢的最多，抢到的红包会存入个人的账户中。',
            },
            {
                q:'3.发红包个数和金额有什么限制？',
                a:'红包个数不少于3个，最多50个红包金币数不少于100。',
            },
            {
                q:'4.未领取的红包到哪了？',
                a:'未领取的红包会在24小时内退回到您的账户。',
            },
            {
                q:'5.在哪里可以查看我的红包收支流水？',
                a:'在充值页面-记录可以查看我的每一次收支详情，在发红包页面也可查看全部记录。',
            },

        ],
    },
    created() {

    },
    methods: {
        navToDetails:function(){
            window.location.href='details.html'
        }
    }

});